Masmiseim36/nxpSDK/boards/frdmk82f/wifi_qca_examples/qca_fwupdate/pin_mux.h
/*
 * Copyright 2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC9 (number 81), IRQ
  @{ */
#define BOARD_INITGT202SHIELD_IRQ_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITGT202SHIELD_IRQ_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITGT202SHIELD_IRQ_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                             /* @} */

/*! @name PORTC3 (number 73), PWRON
  @{ */
#define BOARD_INITGT202SHIELD_PWRON_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITGT202SHIELD_PWRON_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITGT202SHIELD_PWRON_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGT202Shield(void);

/*! @name PORTC12 (number 84), IRQ
  @{ */
#define BOARD_INITSILEX2401SHIELD_IRQ_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITSILEX2401SHIELD_IRQ_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITSILEX2401SHIELD_IRQ_PIN 12U    /*!<@brief PORTC pin index: 12 */
                                                 /* @} */

/*! @name PORTC11 (number 83), PWRON
  @{ */
#define BOARD_INITSILEX2401SHIELD_PWRON_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITSILEX2401SHIELD_PWRON_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITSILEX2401SHIELD_PWRON_PIN 11U    /*!<@brief PORTC pin index: 11 */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSilex2401Shield(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
